In [7]:
import pandas as pd
import numpy as np

In [8]:
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [9]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [11]:
s2 = pd.Series(['a', 'b', 'c', 1,2,3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [12]:
date = ['2023-01-01', '2023-06-15', '2023-08-25', '2023-10-06']
s4 = pd.Series([200, 180, np.nan, 210], index=date)
s4

2023-01-01    200.0
2023-06-15    180.0
2023-08-25      NaN
2023-10-06    210.0
dtype: float64

In [14]:
s5 = pd.Series({'2023':200, '2022':180, '2021':210})
s5

2023    200
2022    180
2021    210
dtype: int64

In [15]:
pd.date_range(start='2023-08-15', end='2023-08-25')

DatetimeIndex(['2023-08-15', '2023-08-16', '2023-08-17', '2023-08-18',
               '2023-08-19', '2023-08-20', '2023-08-21', '2023-08-22',
               '2023-08-23', '2023-08-24', '2023-08-25'],
              dtype='datetime64[ns]', freq='D')

In [24]:
pd.date_range(start='15.08.2023', end='2023/08/25')

C:\Users\kosmo\AppData\Local\Temp\ipykernel_15164\1761927192.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.date_range(start='15.08.2023', end='2023/08/25')

DatetimeIndex(['2023-08-15', '2023-08-16', '2023-08-17', '2023-08-18',
               '2023-08-19', '2023-08-20', '2023-08-21', '2023-08-22',
               '2023-08-23', '2023-08-24', '2023-08-25'],
              dtype='datetime64[ns]', freq='D')

In [25]:
pd.date_range(start='2023-08-25', periods = 4)

DatetimeIndex(['2023-08-25', '2023-08-26', '2023-08-27', '2023-08-28'], dtype='datetime64[ns]', freq='D')

In [28]:
pd.date_range(start='2023-08-25', periods = 6, freq='2B')

DatetimeIndex(['2023-08-25', '2023-08-29', '2023-08-31', '2023-09-04',
               '2023-09-06', '2023-09-08'],
              dtype='datetime64[ns]', freq='2B')

In [32]:
pd.date_range(start='2023-08-25 09:30', periods = 6, freq='30T')

DatetimeIndex(['2023-08-25 09:30:00', '2023-08-25 10:00:00',
               '2023-08-25 10:30:00', '2023-08-25 11:00:00',
               '2023-08-25 11:30:00', '2023-08-25 12:00:00'],
              dtype='datetime64[ns]', freq='30T')

In [34]:
date = pd.date_range(start='2023-08-21', periods=5)
s4 = pd.Series(["짜장면", "짬뽕", np.nan, "탕수육", "팔보채"], index=date)
s4

2023-08-21    짜장면
2023-08-22     짬뽕
2023-08-23    NaN
2023-08-24    탕수육
2023-08-25    팔보채
Freq: D, dtype: object

In [36]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
data_list = np.array([[1,2,3],[4,5,6],[7,8,9]])
pd.DataFrame(data_list)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [45]:
date = pd.date_range('2023-08-25', periods=3)
column = ['A', 'B', 'C']
pd.DataFrame(data_list, index=date, columns=column)

            A  B  C
2023-08-25  1  2  3
2023-08-26  4  5  6
2023-08-27  7  8  9

In [46]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([9,8,7,6,5])
s1 + s2

0    10
1    10
2    10
3    10
4    10
dtype: int64

In [47]:
s1 - s2

0   -8
1   -6
2   -4
3   -2
4    0
dtype: int64

In [48]:
s1 * s2

0     9
1    16
2    21
3    24
4    25
dtype: int64

In [49]:
s2 / s1

0    9.000000
1    4.000000
2    2.333333
3    1.500000
4    1.000000
dtype: float64

In [54]:
data1 = {'A': [1,2,3,4,5], 'B':[6,7,8,9,10], 'C':[11,12,13,14,15]}
data2 = {'B': [1,2,3,4,5], 'C':[6,5,7,4,2], 'A':[11,12,14,52,23]}
d1 = pd.DataFrame(data1)
d2 = pd.DataFrame(data2)
d2

   B  C   A
0  1  6  11
1  2  5  12
2  3  7  14
3  4  4  52
4  5  2  23

In [55]:
d1+d2

    A   B   C
0  12   7  17
1  14   9  17
2  17  11  20
3  56  13  18
4  28  15  17

In [56]:
d2-d1

    A  B   C
0  10 -5  -5
1  10 -5  -7
2  11 -5  -6
3  48 -5 -10
4  18 -5 -13

In [58]:
data = {'봄': [256.2, 156.2, 456.2, 315.5],
       '여름': [118.2 ,154.6, 488.3, 159.3],
       '가을': [512.3, 765.1, 234.3, 486.3],
       '겨울': [132.9, 147.3, 487.9, 324.6]}
columns_lst = ['봄', '여름', '가을', '겨울']
index_lst = [2020, 2021, 2022, 2023]

df = pd.DataFrame(data, columns = columns_lst, index = index_lst)
df

          봄     여름     가을     겨울
2020  256.2  118.2  512.3  132.9
2021  156.2  154.6  765.1  147.3
2022  456.2  488.3  234.3  487.9
2023  315.5  159.3  486.3  324.6

In [59]:
df.mean()

봄     296.025
여름    230.100
가을    499.500
겨울    273.175
dtype: float64

In [60]:
df.std()

봄     125.395863
여름    173.110504
가을    216.958122
겨울    167.603647
dtype: float64

In [61]:
df.mean(axis=1)

2020    254.900
2021    305.800
2022    416.675
2023    321.425
dtype: float64

In [62]:
df.std(axis=1)

2020    182.416501
2021    306.224504
2022    122.509874
2023    133.558311
dtype: float64

In [64]:
df.describe()

                봄          여름          가을          겨울
count    4.000000    4.000000    4.000000    4.000000
mean   296.025000  230.100000  499.500000  273.175000
std    125.395863  173.110504  216.958122  167.603647
min    156.200000  118.200000  234.300000  132.900000
25%    231.200000  145.500000  423.300000  143.700000
50%    285.850000  156.950000  499.300000  235.950000
75%    350.675000  241.550000  575.500000  365.425000
max    456.200000  488.300000  765.100000  487.900000

In [67]:
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [68]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [69]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [70]:
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [71]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [72]:
df_KTX.head(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [73]:
df_KTX[2:4]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN

In [75]:
df_KTX.loc['2012':'2016']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [76]:
df_KTX.loc['2012']['경전선 KTX']

4168.0

In [78]:
df = df_KTX.sort_values('호남선 KTX')
df

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2014    43621     6626     4424     2244      NaN
2013    42005     6873     4088     1954      NaN
2012    39896     6967     4168     1771      NaN
2011    39060     7313     3627      309      NaN
2015    41702     8675     4606     3146   2395.0
2017    32427     9228     5570     5766   6667.0
2016    41266    10622     4984     3945   3786.0

In [94]:
data = {
    'Name':['짱구', '철수', '훈이'],
    'Age':[5,5,5],
    'Money':[120, 400, 50]
}

df = pd.DataFrame(data)
df

  Name  Age  Money
0   짱구    5    120
1   철수    5    400
2   훈이    5     50

In [97]:
df[df['Age']==5]['Name'].values

array(['짱구', '철수', '훈이'], dtype=object)

In [98]:
df.loc[df['Money'].idxmax()]

Name      철수
Age        5
Money    400
Name: 1, dtype: object